const set2Questions = [
    {
        "q": "أين تجد أمر 'اظهر' و 'اختف'؟",
        "options": [
            "الهيئة (Looks)",
            "التحكم (Control)",
            "الحركة (Motion)",
            "الاستشعار (Sensing)"
        ],
        "correctIndex": 0
    },
    {
        "q": "في أي قسم يوجد أمر 'إذا' الشرطي؟",
        "options": [
            "الأحداث (Events)",
            "العمليات (Operators)",
            "التحكم (Control)",
            "المتغيرات (Variables)"
        ],
        "correctIndex": 2
    },
    {
        "q": "أين تجد أمر 'ملامس لـ Gobo ؟'؟",
        "options": [
            "الحركة (Motion)",
            "الاستشعار (Sensing)",
            "الهيئة (Looks)",
            "الصوت (Sound)"
        ],
        "correctIndex": 1
    },
    {
        "q": "في أي قسم يوجد أمر 'اجعل متغير مساويا 0'؟",
        "options": [
            "العمليات (Operators)",
            "المتغيرات (Variables)",
            "التحكم (Control)",
            "الأحداث (Events)"
        ],
        "correctIndex": 1
    },
    {
        "q": "أين تجد أمر تغيير الخلفية 'الخلفية التالية'؟",
        "options": [
            "الهيئة (Looks)",
            "الحركة (Motion)",
            "الصوت (Sound)",
            "الاستشعار (Sensing)"
        ],
        "correctIndex": 0
    },
    {
        "q": "ما هي الأوامر لجعل الكائن يدور حول نفسه بلا توقف؟",
        "options": [
            "'تحرك 10 خطوة' داخل 'إذا'",
            "'استدر ↻ 15 درجة' داخل 'كرر باستمرار'",
            "'عند نقر ⚑' و 'اظهر'",
            "'غير متغير بمقدار 1' داخل 'كرر 10 مرة'"
        ],
        "correctIndex": 1
    },
    {
        "q": "كيف تتحقق مما إذا كان الكائن قد لمس شخصية أخرى (مثل Gobo)؟",
        "options": [
            "أمر (إذا) وبداخله (ملامس لـ Gobo ؟)",
            "أمر (كرر باستمرار) وبداخله (تحرك 10 خطوة)",
            "أمر (عند نقر هذا الكائن) و (اختف)",
            "أمر (اجعل متغير مساويا 0)"
        ],
        "correctIndex": 0
    },
    {
        "q": "كيف تعيد النتيجة (المتغير) إلى الصفر عند بدء اللعبة؟",
        "options": [
            "'عند نقر ⚑' و 'اجعل متغير مساويا 0'",
            "'عند نقر هذا الكائن' و 'غير متغير بمقدار 1'",
            "'كرر باستمرار' و 'الخلفية التالية'",
            "'إذا (ملامس لـ Gobo)' و 'اختف'"
        ],
        "correctIndex": 0
    },
    {
        "q": "كيف تجعل الكائن يغير خلفية الشاشة ثم يصدر صوتاً؟",
        "options": [
            "(الخلفية التالية) ثم (شغل الصوت Pop وانتظر انتهاءه)",
            "(اظهر) ثم (اختف)",
            "(تحرك 10 خطوة) ثم (ارتد إذا كنت عند الحافة)",
            "(غير متغير بمقدار 1) ثم (استدر 15 درجة)"
        ],
        "correctIndex": 0
    },
    {
        "q": "كيف تجعل الكائن يكرر حركة معينة 10 مرات فقط؟",
        "options": [
            "'كرر باستمرار' وبداخله 'تحرك 10 خطوة'",
            "'كرر 10 مرة' وبداخله أوامر 'الحركة'",
            "'إذا' وبداخله 'استدر 15 درجة'",
            "'عندما تتبدل الخلفية' و 'ارتد إذا كنت عند الحافة'"
        ],
        "correctIndex": 1
    }
];
